### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azapi_update_resource.askmebot_slot_vnet_integration will be replaced due to changes in replace_triggered_by
-/+ resource "azapi_update_resource" "askmebot_slot_vnet_integration" {
      ~ id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01/slots/staging" -> (known after apply)
      ~ name                    = "staging" -> (known after apply)
      ~ output                  = {
          - id         = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01/slots/staging"
          - identity   = {
              - principalId = "1e3e2fd7-845f-41ad-a19c-f72b6b754801"
              - tenantId    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            }
          - properties = {
              - availabilityState           = "Normal"
              - defaultHostName             = "plsm-p-itn-askmebot-func-01-staging.azurewebsites.net"
              - enabledHostNames            = [
                  - "plsm-p-itn-askmebot-func-01-staging.azurewebsites.net",
                  - "plsm-p-itn-askmebot-func-01-staging.scm.azurewebsites.net",
                ]
              - hostNameSslStates           = [
                  - {},
                  - {},
                ]
              - hostNames                   = [
                  - "plsm-p-itn-askmebot-func-01-staging.azurewebsites.net",
                ]
              - outboundIpAddresses         = "72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,4.232.99.4"
              - possibleOutboundIpAddresses = "72.146.53.78,72.146.53.93,72.146.53.117,72.146.53.130,72.146.53.144,72.146.53.184,9.235.96.125,4.232.240.146,4.232.249.233,4.232.224.248,9.235.105.32,4.232.248.101,72.146.50.47,72.146.51.63,72.146.51.70,72.146.51.149,72.146.51.191,72.146.51.229,72.146.52.58,72.146.52.69,72.146.52.90,72.146.52.115,72.146.52.116,72.146.52.138,72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,72.146.53.186,72.146.53.199,72.146.53.200,72.146.54.10,72.146.54.12,72.146.48.228,4.232.99.4"
              - repositorySiteName          = "plsm-p-itn-askmebot-func-01"
              - resourceGroup               = "plsm-p-itn-fn-rg-01"
              - slotSwapStatus              = {
                  - destinationSlotName = "Production"
                  - sourceSlotName      = "staging"
                  - timestampUtc        = "2026-01-15T19:43:16.391Z"
                }
              - state                       = "Running"
              - usageState                  = "Normal"
            }
          - tags       = {
              - CostCenter                               = "TS310 - PAGAMENTI & SERVIZI"
              - CreatedBy                                = "Terraform"
              - Environment                              = "Prod"
              - ManagementTeam                           = "Service Management"
              - ModuleName                               = "azure_function_app_exposed"
              - ModuleSource                             = "DX"
              - ModuleVersion                            = "1.0.1"
              - Owner                                    = "PLSM"
              - Source                                   = "https://github.com/pagopa/plsm-service-management/tree/main"
              - "hidden-link: /app-insights-resource-id" = "[REDACTED]"
            }
          - type       = "Microsoft.Web/sites/slots"
        } -> (known after apply)
      ~ parent_id               = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azapi_update_resource.askmebot_vnet_integration will be replaced due to changes in replace_triggered_by
-/+ resource "azapi_update_resource" "askmebot_vnet_integration" {
      ~ id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01" -> (known after apply)
      ~ name                    = "plsm-p-itn-askmebot-func-01" -> (known after apply)
      ~ output                  = {
          - id         = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01"
          - identity   = {
              - principalId = "23beb647-f516-4e73-bc62-4df6459176f1"
              - tenantId    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            }
          - properties = {
              - availabilityState           = "Normal"
              - defaultHostName             = "plsm-p-itn-askmebot-func-01.azurewebsites.net"
              - enabledHostNames            = [
                  - "plsm-p-itn-askmebot-func-01.azurewebsites.net",
                  - "plsm-p-itn-askmebot-func-01.scm.azurewebsites.net",
                ]
              - hostNameSslStates           = [
                  - {},
                  - {},
                ]
              - hostNames                   = [
                  - "plsm-p-itn-askmebot-func-01.azurewebsites.net",
                ]
              - outboundIpAddresses         = "72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,4.232.99.4"
              - possibleOutboundIpAddresses = "72.146.53.78,72.146.53.93,72.146.53.117,72.146.53.130,72.146.53.144,72.146.53.184,9.235.96.125,4.232.240.146,4.232.249.233,4.232.224.248,9.235.105.32,4.232.248.101,72.146.50.47,72.146.51.63,72.146.51.70,72.146.51.149,72.146.51.191,72.146.51.229,72.146.52.58,72.146.52.69,72.146.52.90,72.146.52.115,72.146.52.116,72.146.52.138,72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,72.146.53.186,72.146.53.199,72.146.53.200,72.146.54.10,72.146.54.12,72.146.48.228,4.232.99.4"
              - repositorySiteName          = "plsm-p-itn-askmebot-func-01"
              - resourceGroup               = "plsm-p-itn-fn-rg-01"
              - slotSwapStatus              = {
                  - destinationSlotName = "Production"
                  - sourceSlotName      = "staging"
                  - timestampUtc        = "2026-01-15T19:43:16.391Z"
                }
              - state                       = "Running"
              - usageState                  = "Normal"
            }
          - tags       = {
              - CostCenter                               = "TS310 - PAGAMENTI & SERVIZI"
              - CreatedBy                                = "Terraform"
              - Environment                              = "Prod"
              - ManagementTeam                           = "Service Management"
              - ModuleName                               = "azure_function_app_exposed"
              - ModuleSource                             = "DX"
              - ModuleVersion                            = "1.0.1"
              - Owner                                    = "PLSM"
              - Source                                   = "https://github.com/pagopa/plsm-service-management/tree/main"
              - "hidden-link: /app-insights-resource-id" = "[REDACTED]"
            }
          - type       = "Microsoft.Web/sites"
        } -> (known after apply)
      ~ parent_id               = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azapi_update_resource.fe_smcr_slot_startup_command will be replaced due to changes in replace_triggered_by
-/+ resource "azapi_update_resource" "fe_smcr_slot_startup_command" {
      ~ id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01/slots/staging" -> (known after apply)
      ~ name                    = "staging" -> (known after apply)
      ~ output                  = {
          - id         = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01/slots/staging"
          - identity   = {
              - principalId = "6750170a-5075-4c07-a2e5-dafb0e7e33cf"
              - tenantId    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            }
          - properties = {
              - availabilityState           = "Normal"
              - defaultHostName             = "plsm-p-itn-fe-smcr-app-01-staging.azurewebsites.net"
              - enabledHostNames            = [
                  - "plsm-p-itn-fe-smcr-app-01-staging.azurewebsites.net",
                  - "plsm-p-itn-fe-smcr-app-01-staging.scm.azurewebsites.net",
                ]
              - hostNameSslStates           = [
                  - {},
                  - {},
                ]
              - hostNames                   = [
                  - "plsm-p-itn-fe-smcr-app-01-staging.azurewebsites.net",
                ]
              - outboundIpAddresses         = "72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,4.232.99.4"
              - possibleOutboundIpAddresses = "72.146.53.78,72.146.53.93,72.146.53.117,72.146.53.130,72.146.53.144,72.146.53.184,9.235.96.125,4.232.240.146,4.232.249.233,4.232.224.248,9.235.105.32,4.232.248.101,72.146.50.47,72.146.51.63,72.146.51.70,72.146.51.149,72.146.51.191,72.146.51.229,72.146.52.58,72.146.52.69,72.146.52.90,72.146.52.115,72.146.52.116,72.146.52.138,72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,72.146.53.186,72.146.53.199,72.146.53.200,72.146.54.10,72.146.54.12,72.146.48.228,4.232.99.4"
              - repositorySiteName          = "plsm-p-itn-fe-smcr-app-01"
              - resourceGroup               = "plsm-p-itn-apps-rg-01"
              - slotSwapStatus              = {
                  - destinationSlotName = "Production"
                  - sourceSlotName      = "staging"
                  - timestampUtc        = "2026-03-06T14:42:25.631Z"
                }
              - state                       = "Running"
              - usageState                  = "Normal"
            }
          - tags       = {
              - CostCenter                               = "TS310 - PAGAMENTI & SERVIZI"
              - CreatedBy                                = "Terraform"
              - Environment                              = "Prod"
              - ManagementTeam                           = "Service Management"
              - ModuleName                               = "azure_app_service"
              - ModuleSource                             = "DX"
              - ModuleVersion                            = "1.0.1"
              - Owner                                    = "PLSM"
              - Source                                   = "https://github.com/pagopa/plsm-service-management/tree/main"
              - "hidden-link: /app-insights-resource-id" = "[REDACTED]"
            }
          - type       = "Microsoft.Web/sites/slots"
        } -> (known after apply)
      ~ parent_id               = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azapi_update_resource.fe_smcr_startup_command will be replaced due to changes in replace_triggered_by
-/+ resource "azapi_update_resource" "fe_smcr_startup_command" {
      ~ id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01" -> (known after apply)
      ~ name                    = "plsm-p-itn-fe-smcr-app-01" -> (known after apply)
      ~ output                  = {
          - id         = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01"
          - identity   = {
              - principalId = "da5f8346-fda4-4af3-9372-827d49c0175a"
              - tenantId    = "7788edaf-0346-4068-9d79-c868aed15b3d"
            }
          - properties = {
              - availabilityState           = "Normal"
              - defaultHostName             = "plsm-p-itn-fe-smcr-app-01.azurewebsites.net"
              - enabledHostNames            = [
                  - "smcr.pagopa.it",
                  - "plsm-p-itn-fe-smcr-app-01.azurewebsites.net",
                  - "plsm-p-itn-fe-smcr-app-01.scm.azurewebsites.net",
                ]
              - hostNameSslStates           = [
                  - {},
                  - {},
                  - {},
                ]
              - hostNames                   = [
                  - "smcr.pagopa.it",
                  - "plsm-p-itn-fe-smcr-app-01.azurewebsites.net",
                ]
              - outboundIpAddresses         = "72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,4.232.99.4"
              - possibleOutboundIpAddresses = "72.146.53.78,72.146.53.93,72.146.53.117,72.146.53.130,72.146.53.144,72.146.53.184,9.235.96.125,4.232.240.146,4.232.249.233,4.232.224.248,9.235.105.32,4.232.248.101,72.146.50.47,72.146.51.63,72.146.51.70,72.146.51.149,72.146.51.191,72.146.51.229,72.146.52.58,72.146.52.69,72.146.52.90,72.146.52.115,72.146.52.116,72.146.52.138,72.146.52.175,72.146.52.177,72.146.52.215,72.146.52.230,72.146.52.234,72.146.52.238,72.146.53.186,72.146.53.199,72.146.53.200,72.146.54.10,72.146.54.12,72.146.48.228,4.232.99.4"
              - repositorySiteName          = "plsm-p-itn-fe-smcr-app-01"
              - resourceGroup               = "plsm-p-itn-apps-rg-01"
              - slotSwapStatus              = {
                  - destinationSlotName = "Production"
                  - sourceSlotName      = "staging"
                  - timestampUtc        = "2026-03-06T14:42:25.631Z"
                }
              - state                       = "Running"
              - usageState                  = "Normal"
            }
          - tags       = {
              - CostCenter                               = "TS310 - PAGAMENTI & SERVIZI"
              - CreatedBy                                = "Terraform"
              - Environment                              = "Prod"
              - ManagementTeam                           = "Service Management"
              - ModuleName                               = "azure_app_service"
              - ModuleSource                             = "DX"
              - ModuleVersion                            = "1.0.1"
              - Owner                                    = "PLSM"
              - Source                                   = "https://github.com/pagopa/plsm-service-management/tree/main"
              - "hidden-link: /app-insights-resource-id" = "[REDACTED]"
            }
          - type       = "Microsoft.Web/sites"
        } -> (known after apply)
      ~ parent_id               = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # terraform_data.askmebot_vnet_trigger will be updated in-place
  ~ resource "terraform_data" "askmebot_vnet_trigger" {
        id     = "db178b83-6957-edcc-8f9c-2ea229856cda"
      ~ input  = "2026-03-08T15:47:08Z" -> (known after apply)
      ~ output = "2026-03-08T15:47:08Z" -> (known after apply)
    }

  # terraform_data.fe_smcr_startup_trigger will be updated in-place
  ~ resource "terraform_data" "fe_smcr_startup_trigger" {
        id     = "bdda11c8-4b94-748f-5267-2c4ea0028a84"
      ~ input  = "2026-03-08T15:47:08Z" -> (known after apply)
      ~ output = "2026-03-08T15:47:08Z" -> (known after apply)
    }

  # module.askmebot_function.module.azurerm_linux_function_app_exposed.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01"
        name                                           = "plsm-p-itn-askmebot-func-01"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "Service Management"
            "ModuleName"                             = "azure_function_app_exposed"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Owner"                                  = "PLSM"
            "Source"                                 = "https://github.com/pagopa/plsm-service-management/tree/main"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
      - virtual_network_subnet_id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/plsm-p-itn-common-vnet-01/subnets/plsm-p-itn-fe-smcr-app-snet-01" -> null
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
          ~ vnet_route_all_enabled                        = true -> false
            # (31 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.askmebot_function.module.azurerm_linux_function_app_exposed.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-askmebot-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "Service Management"
            "ModuleName"                             = "azure_function_app_exposed"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Owner"                                  = "PLSM"
            "Source"                                 = "https://github.com/pagopa/plsm-service-management/tree/main"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
      - virtual_network_subnet_id                      = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/plsm-p-itn-common-vnet-01/subnets/plsm-p-itn-fe-smcr-app-snet-01" -> null
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
          ~ vnet_route_all_enabled                        = true -> false
            # (31 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.auth_function.module.azurerm_linux_function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "JWT_AUDIENCE"                                                                                     = "plsm-fe-smcr" -> null
          - "JWT_EXPIRY_SECONDS"                                                                               = "3600" -> null
          - "JWT_ISSUER"                                                                                       = "plsm-auth-service" -> null
          - "JWT_SECRET"                                                                                       = (sensitive value) -> null
          - "MSAL_CLIENT_ID"                                                                                   = (sensitive value) -> null
          - "MSAL_TENANT_ID"                                                                                   = (sensitive value) -> null
            # (20 unchanged elements hidden)
        }
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-auth-func-01"
        name                                           = "plsm-p-itn-auth-func-01"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "Service Management"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "3.0.0"
            "Owner"                                  = "PLSM"
            "Source"                                 = "https://github.com/pagopa/plsm-service-management/tree/main"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.auth_function.module.azurerm_linux_function_app.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "JWT_AUDIENCE"                                                                                     = "plsm-fe-smcr" -> null
          - "JWT_EXPIRY_SECONDS"                                                                               = "3600" -> null
          - "JWT_ISSUER"                                                                                       = "plsm-auth-service" -> null
          - "JWT_SECRET"                                                                                       = (sensitive value) -> null
          - "MSAL_CLIENT_ID"                                                                                   = (sensitive value) -> null
          - "MSAL_TENANT_ID"                                                                                   = (sensitive value) -> null
            # (20 unchanged elements hidden)
        }
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-auth-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Service Management"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Owner"          = "PLSM"
            "Source"         = "https://github.com/pagopa/plsm-service-management/tree/main"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.azure_fe_app_service_smcr.module.azure_app_service.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01"
        name                                           = "plsm-p-itn-fe-smcr-app-01"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "Service Management"
            "ModuleName"                             = "azure_app_service"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Owner"                                  = "PLSM"
            "Source"                                 = "https://github.com/pagopa/plsm-service-management/tree/main"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - app_command_line                              = "node server.js" -> null
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.azure_fe_app_service_smcr.module.azure_app_service.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-apps-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-fe-smcr-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "Service Management"
            "ModuleName"                             = "azure_app_service"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Owner"                                  = "PLSM"
            "Source"                                 = "https://github.com/pagopa/plsm-service-management/tree/main"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - app_command_line                              = "node server.js" -> null
            # (28 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.onboarding_function.module.azurerm_linux_function_app.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                                                                   = (sensitive value)
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/c703d239-22b7-4d1a-9433-145daa884c10/resourceGroups/plsm-p-itn-fn-rg-01/providers/Microsoft.Web/sites/plsm-p-itn-onboarding-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Service Management"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Owner"          = "PLSM"
            "Source"         = "https://github.com/pagopa/plsm-service-management/tree/main"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 9 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.postgres_apps.module.postgres.azurerm_monitor_diagnostic_setting.this,
  on .terraform/modules/postgres_apps.postgres/monitor.tf line 36, in resource "azurerm_monitor_diagnostic_setting" "this":
  36: resource "azurerm_monitor_diagnostic_setting" "this" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 3 more similar warnings elsewhere)
```

</details>
